{"review_id":"XG6h7wJQACgQoy6d8L0UJQ","user_id":"lgcGr4I3Bga4F8l2PtANHg","business_id":"12SbnXfsthBbBaF2YzhLfA","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"We ate at this chili's today for lunch and we never had this bad quality food ever my husband order a chicken fajitas, the chicken tasted like frozen rubber and the beans were liked served out of the van horrible frozen food.\nMy sirloin was not done as directly and my mashed potatoes were worst like frozen food,\nOverall terrible dining \nService wasn't great either","date":"2018-10-20 23:32:02"}
{"review_id":"2S-ISyqTSRsPIi8FjMrhDA","user_id":"0CboQoU2IMjlD8zOHCwDHA","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Was pleasantly surprised when I drove by this place. Did the double take to ensure I was seeing this properly. Stopped by and immediately was greeted by the waiter. Very welcoming environment. Nice and big buffet to choose from for lunch. Very reasonably priced. Food tasted fresh and you can tell they do not skim on the ingredients. Meat dishes are very meaty... just the way I like it. They brought me a basket of garlic Naan. Tasty and complimented the main dish. Hard to find parking since they share the lot with two other business that are also doing well. Will definitely be back when I am back in Nashville.","date":"2018-05-15 13:20:58"}
{"review_id":"spoAurbTxwHs3LaXmt3-xA","user_id":"RQiGNgrDlengZPlEBtLTtw","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"We've eaten lunch here many times & have learned not to go at peak times because the place is a zoo... tho they always seem to stay efficient with service (except last time when I asked for butter to go with my bread I was told to walk up front to the free bread\/butter area & get my own). My partner had a good Reuben recently & usually feels the sandwiches are tasty, if not overly generous. However, I'm a salad person & have tried several different ones, all of which are 90% lettuce with a bit of the wonderful-sounding toppings almost as garnish. The curried chicken salad was yummy but it looked like an ice cream scoopful on a heaping mound of ... lettuce. We may try again, but don't go here if you want a peaceful, relaxing meal.","date":"2014-01-21 17:44:33"}
{"review_id":"dRNSiItvh09NZqJiqIQv8Q","user_id":"5mbpX7I06XPSC3G6OLhg0g","business_id":"gABEjWGwhojrub_tXqE2uw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Food is pretty good for the price, quick, and good for lunch!!! I hate to say this, but the place smelled like fish oil or something when I last went there - it was overpowering and made me upset. Not sure what is going on, but they don't have an email address for contact on their website. Not my problem - but if it continues, will not be going back.","date":"2015-02-05 07:38:58"}
{"review_id":"rwzOkvmYkWUZ07Po66b_vw","user_id":"u1SyRxggmfZMode6mAoCXw","business_id":"Gay6ZhRBF8SNF5YudevDoQ","stars":4.0,"useful":2,"funny":0,"cool":1,"text":"I've tried almost all of the trendy cupcake shops in NYC. I've had some really good cupcakes. Brown Betty's cupcakes are as good and in some cases better than what I've had in New York.\n\nToo often gourmet cupcakes are all frosting and no cake. If you try the cake by itself it is pretty average. Brown Betty makes a moist and flavorful cupcake and enhances it with frosting. Not too little and not too much. The cake and the frosting complement each other perfectly and create a delicious dessert. \n\nNow if only Philly could open a pizza place that makes a pie that rivals the best of NYC...","date":"2009-07-19 21:29:36"}
{"review_id":"uBwd1ZmgoHyiUzN8J8-kqQ","user_id":"65KUM8RxnvI1tE5N-tnoRA","business_id":"FCfTUUTYXfZchPvx7tkoWA","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Great Mexican food with an amazing Mezcal selection.  If you are looking for great Mexican food paired with the perfect Mezcal or tequila drink this is the place to go to in NOLA.","date":"2019-11-02 01:17:31"}
{"review_id":"iF6mB3c_GUs5SmIf1E0t_g","user_id":"gcxL5dUIv4omC2bn0NGDRQ","business_id":"sTfVZ9xo36tU8R5DnaCGkg","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"HOLY BUCKETS!\n\n$2.25 for a taco that takes you out of Tampa and down to Mexico (or at least LA)?  If I lived here, I would go to this place again and again and again.  The location was sketchy at first and when you walk through the door, you know you are in for something great, or something not good.  \n\nSo the tacos.  They have all the meats you could think of to include Lengua.  I was going to go for those, but wanted a tamale too.  So I got carnitas, chicken, and fajita tacos, and the beef tamale.   Cilantro and onions, and the hot sauces there at the table.  \n\nThis is a basic taqueria throwing out awesome tacos.  GO, RUN, CALL AN UBER.  But go here if you live in the area.  Stop by if you are in transit!","date":"2019-02-03 17:12:44"}
{"review_id":"lqqGt6rWjB8sP96kY4Bd1Q","user_id":"TINJU5ib4OMlCL07JqYGhA","business_id":"Dw9_RLgP0lb6pA6q0v055g","stars":3.0,"useful":2,"funny":2,"cool":2,"text":"Copied from my review for the other listing for the Causeway Bridge. \n\nThe Causeway Bridge is not just a landmark and modern marvel (the longest bridge over continuous water in the world) it's become part of the New Orleans culture. The people in New Orleans tend to have love\/hate relationships with our bridges. Most of us view them as necessary evil at best and are afraid they might fall apart at any moment at worst (the truth is they won't, it's just an irrational fear). The Causeway Bridge is the longest of them all, of course, which seems like it would be the one with the most wear. Actually, it's in amazing shape for a gigantic bridge over a huge lake.\n\nNow the downside: it's freaking long. Looong. Twenty six miles, approximately. That's one hell of a drive with a perfect view of the Lake. And by perfect I mean incredibly boring. If you're a passenger there's nothing to look at. Well, that's not entirely true. The bridge is so long you can witness the curvature of the Earth as the shore you're heading for rises over the horizon. If you're driving into the city from the North shore it's quite a site seeing the large office buildings in that part of Metairie come up on the horizon.\n\nThere is no toll heading north from Metairie but it's a $3 toll for the return trip. It used to be $1.50 each way years ago, I'm not sure why they changed it.","date":"2012-02-16 15:16:33"}
{"review_id":"Y8rEBpYq_cNwLMmO5FNWFw","user_id":"ryubBqMSg45VujqRFmC-Bw","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I'm a fan of Indian restaurants because I'm vegetarian and my husband is not.  When we went for the buffet they had some not as common buffet options like spinach paneer,  mushroom mattar,  and potato machurian. \n\nIt's a CLEAN cute small very modern place, you wouldn't know it was Indian unless you smelled the Tikka Masala and saw the buffet table. \n\nGood for a date or small groups. I would not bring a group bigger than 6 here. \n\nMy favorite dish was potato machurian,  those potatoes are cooked to perfection. My husband's favorite was the lamb curry.","date":"2018-01-07 18:56:56"}
{"review_id":"hU72bneMxSB5AA55uqPUhA","user_id":"g_Y88iSiJ39CTd_x1k6rjg","business_id":"Q1LIxVX2BiZ4jSQRmh2k1w","stars":5.0,"useful":8,"funny":4,"cool":7,"text":"Food paradise! Maybe more than 5 stars. You won't believe your eyes when you walk in this little Mexican grocery which is Immaculate inside. Frozen Mexican treats greet you at the door. And you will flip out by the incredible selection of Mexican pastries, cakes and breads. Huge filled delectables for $1 each. Unbelievable. I picked up s flan for $2 and a cheese filled pastry. A family of four could share the pastry it was so huge. \n\nI love these little Mexican run groceries because they are each different and homey. But this one is special. Piñatas hang from the ceiling awaiting selection for a birthday party. The produce is brilliantly fresh. The meats are exotic and fresh as well. Pork, chicken, shrimp steak and much more that I did not recognize. They carry a complete line of spices, can goods, Mexican sodas, tortillas and much more. \n\nThe staff is friendly but not fluent in English so bone up on your Espanyol. Weekends you can expect a friendly crowd anxious to bring home goodies. \n\nThey make fresh tamales for carry out. People were buying them like crazy. $1.50 each for assorted chicken with either cheese, verde or red sauce but I think we want to keep this secret. They smelled so delicious. I'm going back for dinner tonight! Can't wait.","date":"2019-06-09 16:38:27"}
{"review_id":"mUNWFm62atejrOsM8NxiuA","user_id":"v3jR1g-mGJVTTq7gurRN3A","business_id":"HAUzjmv7YWHulWLsgdgmIw","stars":4.0,"useful":2,"funny":0,"cool":1,"text":"I've been to a couple \"Ten\" Food Halls before and it's always fun to see the differences in them. I ordered signature​ ramen. What I really liked was that you could choose what kind of noodles you wanted. I got udon.  The flavor was pretty good but having the noodles I liked made it even better. I also got the colorful fruit green tea with mango popping boba which is always a favorite for me.","date":"2019-09-27 15:20:30"}
{"review_id":"ecey4VQ76GG1Q9TZFRmq0g","user_id":"6Wqqxh8p4mRTxX7qdvLpRw","business_id":"sTfVZ9xo36tU8R5DnaCGkg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Good little hole in the wall taco spot. Everything was fresh and yummy! This definitely is the spot for some authentic tacos! Most of the tacos are $2 each. I had the pollo taco, and fajita.","date":"2018-04-08 21:00:06"}
{"review_id":"CAiP0UJEVU6evodqgHD_6g","user_id":"hmEpv4gsFN5nrEur9MVIMQ","business_id":"jmXrmPfM_X0dm-9OU8pUKg","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Nope I won't be coming back to glory days in Lutz!  I ordered take out and specifically asked for no balsamic on the flatbread.  When I got home, there was balsamic all over the flatbread.  The manager would not even come to the phone when I called.  Wow, awesome customer service!  Obviously there is an issue with the TO GO department!","date":"2017-08-31 00:22:42"}
{"review_id":"HAWXYVU6-JDH_Gw44vC41g","user_id":"6LxpBxyURVXDvcu6l0hELg","business_id":"-Or44IdY51Ukd618kikmtA","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"I never had federal doubts before, seen they just put up this new location and decided to give it a try and I was not disappointed. \n\nAs soon as I walked in I notice how clean it was, I could of ate off the floor no lie. The service was awesome. I walked up to the counter told they guy I never had federal  before and the dude started explaining things like I was at a gallery lol.  \n\nI couldn't stay for them to cook some actual  food so I got 2 donuts.  At 2 dollars a pop it's definitely  the most expensive  donut  I've ever had.  Decide to go for the chocolate glaze and blackberry walnut. The donuts are amazing to compare these to anything else should be a crime. Chocolate glaze tasted so fresh I though I was eating home made chocolate cake.  The blackberry walnut so just as amazing never tasted anything like it. Will definitely be returning in the near future.","date":"2014-07-17 14:38:50"}
{"review_id":"BKzilU2dZa4j6mo2V5dJLw","user_id":"OLEekng8Zy-HncJqbKgkTA","business_id":"Q1LIxVX2BiZ4jSQRmh2k1w","stars":2.0,"useful":0,"funny":0,"cool":1,"text":"Shopped there yesterday.  The clerk was not very friendly.  I purchased a bag of sweet potatoes chips.  When I opened the bag, the chips were rank.  It had a July 17 sale by date. I turned around and took the chips back.  They didn't apologize or say anything.  Not going back.","date":"2017-11-08 19:02:27"}
{"review_id":"_qe7oSFEsWKD4jQ14Vl1Lg","user_id":"f3sOGnvTjgaAxpk8QY0xXg","business_id":"0yELPu1_7T-V3InzfEPS7g","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Love this little place. Real Mexican food. It's fun to watch the ladies in the kitchen making tortillas from scratch and they taste delicious. We tried number 7 on the menu and really liked it. We will be regulars here for authentic Mexican.","date":"2014-05-24 13:18:27"}
{"review_id":"SNizvZPE4HClbKvhB4GFTw","user_id":"ktHblVkFenQ5kic8dbHTcw","business_id":"QFqHy_SUssxq1IpvkpovEw","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"Stopped in for a drink, bartenders were fun.  Had a decent drink variety, had a martini which seemed to be their \"thing.\"\n\nI'd stop by again.  Heads up: the Google Maps and Street View is about a 1\/2 block off from the true location.","date":"2011-10-19 15:39:06"}
{"review_id":"MGR08vSWQx2_ZTZTAA0a0Q","user_id":"X_V7DRNRhtaGbZnxBmCvqw","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"New Indian Restaurant opened in the Donelson area .... Great Ambiance, Good Food and Fast service... Ordered the Pav Vada, Navratna Korma Veg., Bhukara Dal and Phirni... yummy food with authentic taste... Highly recommended... will visit this restaurant more often!!! Warm and welcoming staff!!! Really needed an Indian Restaurant in this area!","date":"2017-09-17 02:59:42"}
{"review_id":"hBJ-8ADgNRVWa735qFAXxg","user_id":"tr7MN0awianpN5wKBtRgAg","business_id":"jmXrmPfM_X0dm-9OU8pUKg","stars":2.0,"useful":0,"funny":1,"cool":0,"text":"The beer and the TVs. That's it. Otherwise the food and cocktails belongs in a glory hole.","date":"2018-09-15 15:40:26"}
{"review_id":"ZHAJMZkT-IgnR3ZtNT67cQ","user_id":"yInNj9eDZ1JAUIZ4n0P6Jg","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":3,"funny":1,"cool":2,"text":"When the open back up again, this is the place to get your Indian food fix during lunch. They have an awesome lunch buffet but you can also order all of the dishes a la cart if you prefer.  They do take out at the moment and delivery as well.  They have a lot of the typical standard favorites but they are done very well.  When eating there the service has always been attentive and very responsive to any requests.  \n\nThe restaurant is tucked away in a corner of small plaza so don't get swayed by that. It's very clean and bright inside as well.  There have been a couple of times for dinner that we tried to walk in and all the tables were full!  So try to call in to see if there's availability.  This right now is my go-to restaurant for Indian food in Nashville.","date":"2020-07-01 19:59:04"}
{"review_id":"uX4WvsBrhg5XFNiDLMGCQQ","user_id":"UayCSf-vmYA1VnloUwYEWg","business_id":"QFqHy_SUssxq1IpvkpovEw","stars":5.0,"useful":3,"funny":0,"cool":0,"text":"Very quaint place that serves out of the box pizza\/flat bread. By out the box I do not mean the pizza\/ flat bread came out of one. they have very unique combos that one would never think of making. Their appetizers are very good we had the tuna and also the bacon wrapped scallops. Nice selection of Martinis and a wide selection of bottled beers. No draft beer but I personally think that is a great idea and limits the risk of bad beer. Really worth the trip for a nice dinner and a few drinks.","date":"2015-04-05 01:16:06"}
{"review_id":"u3C3b_alh3sA9xduFOCtQQ","user_id":"Fu1Bi0h3cluDj1sfPOsWSg","business_id":"WRSUURl5C9bQd-uoutOVVg","stars":2.0,"useful":2,"funny":0,"cool":0,"text":"I am speechless. First off let me say that the dinner I had there was very good, and that brought this review up to 2 stars. I seriously cannot believe all these positive reviews on the beer at this place. The food and atmosphere are good. I was impressed with the menu and decor, but since when does that make up for beer that isn't made very well. I am shocked at the apparent lack of beer knowledge by my fellow Nashville citizens. I will say that the beers weren't bad due to any overt brewing defects, I didn't notice overbearing diacetyl or oxidation, but it just wasn't great craft beer. None of the beers I had were true to style, nor were they impressive. This place is cool, but the beer just isn't.","date":"2013-07-11 23:20:14"}
{"review_id":"4rtfLcMYgL7-OS7jnOnMNQ","user_id":"ccGP_7R32pVQywVjCC9lmQ","business_id":"QFqHy_SUssxq1IpvkpovEw","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"This restaurant is a great little find.  I came on Valentine's Day and it was packed, but did not have to wait long for a table.  The menu is small, but they are small so i commend them for not trying to do more than what they can handle.  The drinks, are AMAZING!  I tried 3 different martinis (X-Rated, Dixie, and the White Chocolate).  I don't know which I would choose if I was to go back.  Our server was great, the owner stopped at our table to ensure we had everything we need, and the atmosphere was unbeatable.  I would recommend this to anyone who like martinis and good food.","date":"2013-02-18 16:09:30"}
{"review_id":"Csvaq-O0t-aG2psKpObI0g","user_id":"fth0V5AVqtGYofktbiquSg","business_id":"ki0qSHmHNgUjKPRzYDTPow","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"I had been here in the past and this... this almost a mixed review. \n\nNow I go in and the decor is different and we see that the bill is half off. This raises my little red flag since it seems like a cheap way to bring in customers. But I give it a chance and we were seated immediately. It was someones birthday we were celebrating. \n\nIn the past the staff would sing or do something a little special. First of all, our waitress, while MUCH nicer than other staff there who were complaining the whole time in a little station well in our view, didn't seem to even care. She said happy birthday and that was it. We even ordered a dessert and here I was thinking they would at least put a little candle or something as many other places have... but no. Nothing. \n\nThe food was alright.. nothing spectacular and to be honest I found their limited Wednesday menu disappointing. They also went up in price which didn't really sit well with me. They did give a lot of food but it just not the best.\n\nThe other waitresses really are what will keep me from coming back. They were having discussions that didn't need to be happening in front of us like about their shifts, and how much money they made. They even had the nerve to count their tips nearby booth and it was only 10pm. One waitress was in the bathroom waiting for a ride which I've never seen before. \n\nI only have three stars because half off is a nice treat but really... eh. I don't know if it was worth it. I miss the old owners and the good food.","date":"2012-07-16 18:16:20"}
{"review_id":"Al_rUvlgptq0Weq4z0ZwzQ","user_id":"cz8V3wu_Hb85oQQYKTQYOw","business_id":"Gay6ZhRBF8SNF5YudevDoQ","stars":4.0,"useful":2,"funny":8,"cool":0,"text":"On my most recent trip to Philly, a friend forced me to go here. I say \"forced,\" because I hate the very idea of cupcakes. I'm what the French call 'le broke' and for $3 I can tap into the Dark Arts to summon a whole two-layer cake from a little box found in any grocery store. \n\nBut under threat of having to walk back to DC, I paid a two-layer cake's worth of money for one strawberry cupcake. A small angelic tear forms in the corner of my eye when I think back to that first bite. Now it could very well be that I've just become accustomed to boxed cake mix and thus overreact when presented with something made from real flour and sugar, but I swear it felt like my teeth sprouted taste buds just to enjoy that cupcake. \n\nI can't comment on the density, butter ratio or PH level of the cupcake like everyone else, because frankly...I still make cake mix for the guilty pleasure of licking the bowl. Yelp has taught me that I'm a neanderthal when it comes to food. I bit into it. My teeth liked it. I swallowed it. A smile followed. This continued until there was no more cupcake. The aforementioned smile then collapsed under the weight of grief into a frown. That's worth four stars.","date":"2013-04-21 03:07:39"}
{"review_id":"b0joJXpFIFuecIc7aA4JYQ","user_id":"JyzLjUFEIW3epNlHI6Oa6Q","business_id":"jmXrmPfM_X0dm-9OU8pUKg","stars":4.0,"useful":4,"funny":0,"cool":1,"text":"I didn't have high expectations coming to a chain restaurant of this nature, but I was pleasantly surprised after my visit.  This place is still new and the waits and crowds truly reflect that.  On a recent weeknight we had to settle for a hightop in the bar as a table would have been a lengthy wait.  I was impressed by all the TVs and commented to my friends that this would be a great place for a weekend game watching event.  \n\nThere are plenty of specials offered pretty much every night of the week and the wait staff is pretty attentive and friendly.  I had the Chicken Ranchero wrap, which was a generous portion and pretty standard in terms of flavor\/taste.  Drink specials are also plentiful and the bar area is very lively here.","date":"2017-07-30 21:25:04"}
{"review_id":"9iPjZPgHu-DcFdY6ZGqo3g","user_id":"XaxRz8TNHNbLZQsgRKZi3Q","business_id":"nSJbJtBiAM2NNnzEgUs9Bw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I love that Five Star understands being on a team represents life skills beyond the gym and uses them to encourage growth in their athletes! As a result bonds are built, athletes progress mentally and physically, and teams are stronger. It's truly a second home! The best place in Nevada to watch your athletes thrive and make great friends along the way! It's been a great journey so far and I can't wait for the memories yet to come","date":"2016-02-09 17:22:35"}
{"review_id":"DmX-jMRP_UGC-SW-oqr5PQ","user_id":"siVtjO8xrSxbrK-zqXCGew","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"I really love the turkey and brie sandwich from Beyond Bread.  The honey mustard they put on the sandwich is divine.  I got the pasta salad on the side and it was full of crunchy corn and veggies.  I always ask for the sandwich on softer bread because the baguettes rip up my mouth.  The multi grain bread is a great substitution.  The desserts look absolutely decadent.","date":"2016-09-28 00:27:01"}
{"review_id":"3eiXh6FZ49dq9hpcOZEJNA","user_id":"Y7BpfDyR3dCPXIP5pOOcKw","business_id":"VD2jA3aLp8MfR8BiWWKs0w","stars":5.0,"useful":1,"funny":1,"cool":0,"text":"Saw great reviews on Open Table and here and tried this place out. Loved it!  Went with my wife and 2 kids (11 and 14). Very casual and BYOB. Complimentary valet parking helps in Belmont Hills too. Place is nicer than it looks in online pictures. Waitress was ok and did not tell us all the specials but food was delicious and well priced. Great mussels as an appy with good bread (would have liked fresh Parmesan).  I had delicious lobster ravioli but could have been lighter on the rose sauce. Wife had shrimp and kids pasta dishes. Dishes all could have been just slightly larger portions but were ample enough to fit in dessert too. Good tiramisu and blueberry Jewish cake for dessert. Overall a really good local place that we will definitely visit again!","date":"2017-02-05 01:33:28"}
{"review_id":"ePlv51fDJSbevbIOw2ixeg","user_id":"kfl2vhILfiu38IeX9yswfg","business_id":"0yELPu1_7T-V3InzfEPS7g","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"This place is the best mexican food in Clearwater. By far. The bistek tacos are amazing- try them. \nThey make their own corn tortillas; right in front of you. The salsa is killer, too. \nThey recently did a mini-makeover on the place so it is less scary to sit down than before, but it is still pretty ghetto. Gotta love the bright pink leftover ice-creamery tables they found!","date":"2012-07-18 16:00:29"}
{"review_id":"yEDqZZ5IWm0Rt_jrINDBhg","user_id":"ArCAf-Y8XgbX2Mouzxmnmg","business_id":"eQIyzHeRQQYc55Oihq5YPw","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"this place hit the spot in every possible way. I am a huge seafood fan, especially crabs. It seems the local places have the \"crab nights\" for the Alaskan crab, but it is getting harder and harder to find BLUE CLAWS on a menu, let alone ALL YOU CAN EAT on a random night during the week. LOOK NO FURTHER WE HAVE FOUND THE MOTHER SHIP... not only do they have the BLUE CLAW CRABS, they offer ALL YOU CAN EAT... not one night a week, not only just a week night... but they offer ALL  YOU CAN EAT 7 DAYS A WEEK as a menu item. \n\nthis place offers additional items on the menu which include Po Boy sandwiches, seafood selections as well as hamburgers and salads... they have something for everyone who has taste buds. \n\nVery casual atmosphere, like hanging in a friends house, kicking back enjoying the great food and great company... and if you want to have a cold beer, don't forget to bring it.. cause it gets even better.. IT'S A BYOB.","date":"2012-07-20 21:24:45"}
{"review_id":"spcvGw_Nt8QrKzv-Wrn0Jw","user_id":"1DlOe_pgs9zqDjpmO8zFAg","business_id":"Dw9_RLgP0lb6pA6q0v055g","stars":2.0,"useful":1,"funny":1,"cool":0,"text":"It's narrow, it's long, it gives me mild panic attacks, it has a $3 toll to get back from the north shore. On the plus side, there actually appear to be places where you could turn around before traveling the full length of the bridge, once you realize you've made a horrible decision.","date":"2012-06-29 22:32:24"}
{"review_id":"RXIU0hC-nTYTempM0QtsVA","user_id":"zIvtbz5xBdUqFwUKH4uQqw","business_id":"dS6YwOhkFzcb28SeMtG3LQ","stars":5.0,"useful":2,"funny":0,"cool":0,"text":"I've been coming here for a couple years and lately this pizza joint has delivered!! Usually I go for the deep dish but this time I went with the traditional thin crust and I'm hooked!! We went on a Saturday and the special is one free topping so we went for the \"meaty mafioso\" with green olives on top. So good!! The menu has changed a little but you can order a variety of pasta dishes and no more bone-in chicken  wings (rip wings). However, they do have boneless chicken wings (chicken nuggets). But hey, most folks go for the pizza and it's really good!! \n\n Pro tip: Mondays are $2 domestic pints, so....word to the wise. I highly recommend Noble Roman's, it was a nostalgic part of my childhood and so glad to see actual pizzerias back as a pub. Want pizza? They got you!!","date":"2022-01-02 22:24:49"}
{"review_id":"aCgevt8OKyWtjfdt0AswLA","user_id":"qtqvz37G4Ryxgx9SnQADyA","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"If you have been east of the Rockies and are familiar with Panera, then you know what Beyond Bread is - an expensive sandwich shop. The bread is very good, therefore the sandwiches are good but this isn't a place that I can afford to frequent very often. If I am going to spend my hard-earned money on a restaurant I'd rather spend it on a hot meal where I feel like I'm getting my money's worth.","date":"2012-06-06 04:03:20"}
{"review_id":"_UVG0PikRexIOYpq4CxXuQ","user_id":"_FbRykTYokfMSlkvwVxEQw","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"The angus management salad is phenomenal! Customer service is always friendly and fast and my order comes out perfect every time. Only negative is dining in can sometimes be difficult because they always seem to have a shortage of tables at peak times, but that is to be expected of a restaurant with amazing food. Can't go wrong with anything on the menu everything is fresh and delicious!","date":"2016-09-26 06:55:16"}
{"review_id":"AwcuAJtSBjZi6fjjx-7Cjg","user_id":"NizeWulM4ak4H3sBcrFH0Q","business_id":"HAUzjmv7YWHulWLsgdgmIw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Food is a 3.5 star, ambience 4.5 star, therefore average 4 star.\n\nTheir signature ramen comes with three kinds of meat - shrimp, pork, and chicken. Shrimp and pork are not bad. The noodle is decent. The broth is not bad. There is nothing particularly horrible, just not tasty enough that I'd go out of my way to revisit or recommend to others.\n\nAmbience is great. Clean, modern, ample seating including the second floor. Music is loud but that might suit some people. \n\nAll in all, a welcome addition to Rittenhouse Square, even thkigh there are (many) better ramen places out there.","date":"2019-05-12 22:40:45"}
{"review_id":"Xufx_YSLeuueD6jyxQ2fIA","user_id":"t6v-stl1fnWYSCMVC0G8qQ","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing food. came two days in a row. highlights were seekh kabab, frozen paan, chop chop paneer and chicken stir fry.","date":"2018-09-16 02:21:22"}
{"review_id":"SzJrbQWn09d5zpCzTO-o5Q","user_id":"lagwRZFttxWfgXmaeVlJFQ","business_id":"8OPE0UaZHf7vdYkgbIj8vg","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"We stopped in on a Sunday evening. I was surprised that there was only a few cars in the parking lot. Sat at the bar and was taken care of quickly by the bartender. Placed our order or wings, spinach dip and the special of a half rack of ribs. Our food took over 30 minutes to get despite there only being one other table of guests eating. My ribs came out stone cold, not luke warm, cold. Wings came out fine and the chips for the spinach dip were stale.  The manager who was also the cook was told about it and never came out to address the issue. After that, I went into the bathroom and found no soap and no paper towels. I asked to speak to the manager and told him that I was displeased with the issues. He barely mustard up an I'm sorry with no explanation for any of it. After all of that, the bartender comped our food and apologized for his manager. Just my opinion but the gm here on Sunday night is not competent to run a restaurant. We will not be returning for anything other than drinks. I'm pretty upset that I can see Mckenzie grill right down the parking lot and didn't go there. Lesson learned.","date":"2016-06-13 00:09:41"}
{"review_id":"E_QK2RrCZuojQJu-xUkk8g","user_id":"5T4UirkARwaz2PZ0T_-CYQ","business_id":"Gay6ZhRBF8SNF5YudevDoQ","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"I was in the city today and wanted to pick up some cupcakes for my mom's birthday.  I remembered browsing through living social this past week and remembered seeing this place.  I opened the deal and was surprised to see that 1800 people had bought the deal.  I immediately bought one because I knew it had to be good.  The deal is $9 for 6 cupcakes, which is a great deal for gourmet cupcakes! I bought 6 different kinds but I only tried the red velvet with cream cheese icing, and a good ol vanilla with chocolate icing.  The icing was rich in flavor but it was also very light.  The cake was moist and a little heavy but in a good way.  The cake is denser, almost like a pound cake.  The people who worked there were friendly and pleasant.  Next time I go, I'm only gonna share after I've taken a piece of each one and tried all the flavors!","date":"2014-02-02 06:12:56"}
{"review_id":"R1jclhrp9lR3r8XhjWDM4w","user_id":"uje1x_ykhdhSiUO4H4jAcw","business_id":"sTfVZ9xo36tU8R5DnaCGkg","stars":5.0,"useful":2,"funny":2,"cool":2,"text":"Authentic Mexican tacos. It's a hidden gem in Tampa. Ask for cheese and avocado as extras!","date":"2014-12-22 19:35:43"}
{"review_id":"ng_5zTuDAJUA26ECuBRyGA","user_id":"uqBlRc_lS7O9qVcZ9nvWzg","business_id":"jmXrmPfM_X0dm-9OU8pUKg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Wow, where do I begin.....the food was awesome (wings were very GOOD) & the customer service was exceptional!! Ivy our server was great, she made great recommendations & was very attentive. Sal, the manager took the time to chat with us about this being our first time visiting the restaurant which was definitely a plus. If your in the area definitely stop in or if not it's worth the drive, you will not be disappointed!!","date":"2018-08-04 18:53:24"}
{"review_id":"yjPH5ayO7vipuUp8yKmg7g","user_id":"BJNxQGG3dx5uLxINGA5kDg","business_id":"mHzTDjMxRPiWtuzEn3xOpg","stars":3.0,"useful":4,"funny":2,"cool":3,"text":"This is  in one of those plazas that you just drive by but never go into.\nThe interior is small with a brick wall and brown floors\/silver metal chairs. It's clean but looks a little dark,flat, and unappealing.\n\nI went for a lunch since it was barely 3 miles from the house.\nThere are 2 lunch specials depending on toppings\/pizza slice. one for 6.25 and one for 7.50.Both include a fountain soda.\n Now there were 2 pizzas on racks , a Sicilian cheese, and a thin white\/spinach pie. I ordered the Sicilian (2 slices) and asked if there was pepperoni on it since I couldn't get a close look. He said yes. However, when it came time to pay , my order was $9 bucks. Apparently he thought I asked if i wanted to ADD pepperoni to it which upped the price $1.5 \n\nAlso it was a bit annoying that the tip option is asked before you complete the transaction on the card reader. Usually most businesses complete the main transaction FIRST, then the tip or ask you to write the tip on the receipt. They give you a plastic cup for the fountain drink and the machine is a Coke centric one. Nothing else to write home.\n\nThe pizza was decent, but not  a revelation.The crust tastes different than many other places. In fact, since I had Jet's sicilian pepperoni just a few weeks ago, I think I like theirs better. Blasphemy, I know to like a chain place over indie , but oh well. Plus, Jets was $5 for exact same meal basically.\n\nThey should just make the lunch special one uniform price ($8) instead of doing upgrades imo.\n\nOverall: Ok, but not a place I'd run back to soon","date":"2018-09-25 18:44:32"}
{"review_id":"rbuBYZT9P3BYbldWVE7fkw","user_id":"0EmN2Ld2qmJBdR_odDX-ww","business_id":"oOdSPQGdcpCQhuzBwLtrYA","stars":2.0,"useful":0,"funny":0,"cool":0,"text":"Decent staff but found a hair in the chicken minis... plus the chicken didn't seem cooked all the way through.","date":"2017-11-20 16:04:44"}
{"review_id":"PvIN4qSj0RTqNvMxRe_dSg","user_id":"dvuk2AH4MSH5gWln1WwKAg","business_id":"jmXrmPfM_X0dm-9OU8pUKg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Sat at the bar. Place wasn't busy. Pleasant bartenders. Drinks tasted great. Black Bean Burger was decent. Fries come out in a silverware dryer thing, idk. Overall good experience.","date":"2017-10-10 00:23:35"}
{"review_id":"WarM5M7zrGbKESz8q5ed9A","user_id":"olKHTqB0pydLHO3pnOFZcQ","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":1.0,"useful":10,"funny":0,"cool":0,"text":"This place should be called \"Beyond Rudeness\" or \"Ergot Bread\" since the man in charge decided to take his attitude out on my family and they sold us past due bread. \n\nMy mother and I were once fans of their bread. We bought a loaf of \"supposedly fresh\" rye only to find mold on the loaf. We decided to return it.\n\nOnce there, we requested for the manager and my mother asked for a new loaf. He shrugged his shoulders and denied us an exchange while announcing it was her fault the bread went moldy. He then said that their bread has no preservatives while implying that mom should learn to store her bread appropriately. If the bread is being sold fresh then why is it molding withing 14 hours?\n\nI then decided to give the man some wisdom.\n\nI looked him in the face, and calmly said: \"If your bread has no preservatives then your bread will have a shorter shelf life. Don't try to play beat around the bush and tell me to accept molded bread.\" He was taken aback and said only this one time would he accept our return.\n\nThe bread they sell could be days old at point of sale, the man in charge has no customer service skills, and the price vs. quality in food does not match up. I will stick with Subway.","date":"2011-08-28 22:42:05"}
{"review_id":"dzoKq-bCpRN6jBqkFgvIfw","user_id":"btSaJqMiUwMemMZ1AhCe3Q","business_id":"sTfVZ9xo36tU8R5DnaCGkg","stars":5.0,"useful":3,"funny":1,"cool":1,"text":"In a town of Cuban food, I was happy to finally find AMG.  AMG makes great Mexican food and charges you very little for it.  The restaurant is at the back of a small Mexican grocery store.  The grocery store has produce, sauces, and the like.  There was nothing vegetarian on the menu, but they were more than happy to make me veggie tacos, and the tacos were cheap--$1.50.","date":"2013-10-09 02:34:54"}
{"review_id":"uMvxSLocvM1Ovw-Ld8sy_Q","user_id":"gYhKVVPjbfOq8V2wvQ_ncA","business_id":"-Or44IdY51Ukd618kikmtA","stars":4.0,"useful":2,"funny":1,"cool":2,"text":"I had several donuts and each was really good. The strawberry lavender was fresh and hot and not overly sweet, while it tasted more of strawberry than lavender it was nice light donut. The Chocolate 3  was super moist and as the name implies super chocolatey while managing not to be overly sweet. My favorite was the Chocolate Oatmeal. It was again moist, not overly sweet and had a richness that made this one my favorite by far. The service was fast and friendly and this location has ample parking.","date":"2017-10-18 18:51:40"}
{"review_id":"wSIe-Ior81uy3e_1FAbECA","user_id":"hL-p_AOo53wJyYrggzYMVg","business_id":"zEs2XsSVdAvyjaTXhmG5Qw","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Whole Body is a separate store owned by Whole Foods.  They have everything from organic clothing (small section) to purses made out of hemp and recycled tires, to lotions and makeup.  \n\nA big part of this shop is vitamins and various shake mixes, organic teas  in raw form (they have one of those \"serve yourself\" tea bars) and other sundries to make you healthy from the inside out.  I was mesmerized.  And realized that the Flintstones vitamin I take daily probably isn't sufficient!  Haha.  Actually, after leaving this store, it made me want to totally revamp my lifestyle...start making protein smoothies, wear only organic cottons, and ditch all my bad make-up.  After I go to the Sounds game tonight and eat a hot dog of course!  \n\nCool store.  Much more than clothes, which is what is in their windows, so don't let that fool you!","date":"2008-05-01 22:04:09"}
{"review_id":"pKgi0bn6SC4gEZXkfyIDBw","user_id":"aqpdWZr2pvVTDlr3-MWZww","business_id":"QFqHy_SUssxq1IpvkpovEw","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Walked in to have a drink and a meal to a less than half full restaurant and sat ourselves.  Two waitresses walked by us multiple times without even saying a single word. After 20 minutes without any type of service we left. Will not return.","date":"2021-02-14 00:48:06"}
{"review_id":"ilMnkqbXKbLer5OG2qSAXg","user_id":"M0xeLL5x89vC4wvrKABjhg","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":5.0,"useful":1,"funny":1,"cool":1,"text":"I had their Avi's Avo sandwich, husband had some curry salad. \n\nNothing in this world could have prepared me for how humongous that sandwich was. I usually can put away quite a bit of food but after half sandwich, I was extremely full and for hours to come. His salad was delicious as I gave him the other half of my sandwich and ate some of his salad. \n\nWe will be eating there another time or two during my business trip to Tucson. \n\nHighly recommended! Although... I suggest a half sandwich. \n\nYou order, find a table, wait for your food.","date":"2013-06-26 02:17:51"}
{"review_id":"KaPfHKGQoffTJCIFLf_byw","user_id":"uRmMh_8Z5mSvq9-x6LxQRg","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"The best Indian food I have ever eaten anywhere in the world. Flavors and authenticity are incredible. Generous portions that give everyone a chance to share the taste of your dish. Go see Aki and his chef. You will be so happy you stopped here.","date":"2021-06-17 02:46:26"}
{"review_id":"eVS7iS5Z72Zn79XxhkkJVA","user_id":"hEoCgGklQtYQzgAPeIaWTw","business_id":"gf0hWSKB38InSJBKioqKrQ","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Quite a bargain! I like this location better than the other location because I think it's in slightly better shape. The seats seem a little nicer and not so many broken ones. However, I appreciate that there is still such a thong as a $3 movie, so I have no complaints about either location!","date":"2019-02-25 19:55:57"}
{"review_id":"MbTClZGI5QQWHEeGeG8Bzg","user_id":"qeEFtCNqliPfzMJYYEwApg","business_id":"2yf8vIDgZJpEX5MeLoyqpQ","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"If only I could give them a zero, I would!  First informals the dispatcher is so very rude and unprofessional. I was told I would get have a care in 15 to 20 minutes. After 25 minutes of waiting I called back only to be told that she did not have my address and hung up in my face again. I called a 3rd time and asked why did she hand up in my face and what did it mean if she didn't have my address, was she putting in my address now and sending a cab. She stated \"I thought you were finished.\" I told her most people say something like goodbye to indicate they are finished talking. She explained, people like her who answer calls all night \"don't have time to say goodbye.\" Such unprofessionalism. Of coarse I cancelled the request for the cab driver and will never call them again!","date":"2016-08-07 11:42:21"}
{"review_id":"WqhcjZJeFLCbJZfw28fhXQ","user_id":"38rGW0HFuQXXYk5KDUfbVA","business_id":"thPaS6BuJhbkCupna-UN5A","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is one of the most clean, most helpful and overall best Sephora locations I've been to and, trust me, I've been to a lot. The staff is very friendly and knowledgeable, and always have great products to show. I usually find salespeople a little bit annoying, but I always talk to people at Sephora - they are very nice and personable. If one of them comes up to you, ask them about what they recommend that day because there are always great new products or sales that they can show you.\n\nA lot of my concerns have been about the correct creams and moisturizers for my face (problem skin!), and the salespeople there are always very helpful and give great recommendations depending on what my face's problem-of-the-week is. The best part is, I feel that they really do recommend what they believe is best, and not just what they are told to push that week. I've also had a lot of questions about other makeup products and I've always been shown a few different options that I can choose from. My only quibble is that they always seem to be out of the point products at the register, but that isn't the store's problem.","date":"2015-04-14 19:00:30"}
{"review_id":"c7Hn_j4vmPaj_iPTswHG8Q","user_id":"J8zHbeXn4g1s-Yx-3W_pDA","business_id":"gABEjWGwhojrub_tXqE2uw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Very good food with a variety that you can try something different each time. Have had the New Orleans and a couple of others and they are all great!","date":"2016-02-13 21:03:49"}
{"review_id":"hXG-92-Ifb1ExteBxFl7Zg","user_id":"1-Gh0Y1OHlD1Bl0fo6rYmA","business_id":"mHzTDjMxRPiWtuzEn3xOpg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Never heard of this place until someone recommended to us. So we took the kids and got some pizza salad and mozzarella sticks to go. The owner of the restaurant was very very nice and pleasurable to deal with. The restaurant is very clean. Prices are very reasonable. The meals that we got were very tasty and good. We will definitely be going back here.","date":"2018-02-20 12:55:30"}
{"review_id":"YlWiUQfITeL5PtueGorTMQ","user_id":"Ip1FiwLb9uluKIokFOjtLg","business_id":"12SbnXfsthBbBaF2YzhLfA","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"I love their fajitas! But was so disappointed when I ordered them to go. I called ahead for their curb side delivery.\nWhen I arrived I only had to wait a few minutes for the order I had placed to  be delivered to me curb side.Disappointed due to the amount of protein provided as well as the sides. Only order fajitas at the restaurant our you'll be disappointed.Not kidding!\n+","date":"2016-06-05 00:09:54"}
{"review_id":"LvSg_oNXPmquoIfUa1eluQ","user_id":"qfqCD_cUKh84jcYVVmVpUQ","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Food here is always amazing! The chicken Korma is my absolute favorite but everything I have tried here has also been super yummy. The staff is always kind, friendly and helpful.","date":"2020-07-01 23:04:48"}
{"review_id":"CvEyrwPxQwz2Gvl53IU4HQ","user_id":"NWvz_GauauGfZF2T7FDjEg","business_id":"FCfTUUTYXfZchPvx7tkoWA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Amazing food, great service and good drinks. It's a little off the beaten path but pretend you're a local and go. The salsa trio was fresh, and give the beet taco a try - trust me, it's worth it!","date":"2019-12-31 23:04:40"}
{"review_id":"1ErDIoH0fiKLqjWlNfC4oQ","user_id":"UpAEeYb5ungnGDm9c9-SIw","business_id":"0yELPu1_7T-V3InzfEPS7g","stars":4.0,"useful":0,"funny":1,"cool":0,"text":"Authentic Mexican food. The pork torta was excellent and my wife got some spicy vegetable gorditas she really liked. Only four stars as the food was a bit pricey and the interior is small and warm. Also, if you're not fluent in Spanish you might want to bring a smartphone to Google the foods...","date":"2014-09-11 23:04:31"}
{"review_id":"BbgaCQ4Z0W1isF3E67sY5w","user_id":"UV6kQ5MqadMq9SaVv35fqg","business_id":"WRSUURl5C9bQd-uoutOVVg","stars":5.0,"useful":1,"funny":0,"cool":1,"text":"I can see myself becoming a regular here. It turns out I already know 2 of the guys that work here, so I'll def be in good company.\n\nI've waited to visit the brewery so as to not be bombarded by big crowds or long waits for service since the big opening. Finally visited here last night and I m going again tonight! The food and service were wonderful and the beers are definitely some to boast about.  As a big fan of porters and stouts, I'm surprised and thrilled that they have more than one dark beer, unlike most other small breweries. \n\nI started with the sampler, which inlcudes a 5oz pouring of their 4 beers for $6 (their 5th beer coming soon!).\nI truly love them all, but I'm totally diggin the Ruby Red. Also read on their twitter to ask them about  the Red Bettie: half Ruby Red + half Black Bettie...a must-try for tonight!  Ended up walking out of there with a growler of the Bertha Oatmeal Stout and 2 tshirts....and two beer glasses with their logo. Yep. big fans after one try. That's gotta tell ya something! Can't wait to wear my shirt at the Beer Fest next wknd. Fat Bottom will be there too!!\n\nAlso, we can't forget the food. The deviled eggs with crab were AMAZING. Going back for more food tonight!  See ya there!!!","date":"2012-09-29 18:46:39"}
{"review_id":"C5d4BkJnDKrGQJ7FdrPCFA","user_id":"u_zkRSa5vs8xf1KLJ9f24A","business_id":"sTfVZ9xo36tU8R5DnaCGkg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"This is my go to taco spot! Friendly workers, great food. I've gone at least 10 times and will go back 100 more!","date":"2019-05-08 21:43:11"}
{"review_id":"q2XC6X8GwfTyYOwLkgg7qg","user_id":"vcKSZqW_CcPCLnIqJ0l1uQ","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":5.0,"useful":0,"funny":0,"cool":1,"text":"Mac and cheese tomato and basil so good! Macchiato was great as well! Will be a half cup of espresso and the other half is filled with foam. Seating is bad during peak hours- cafeteria style seating. Staff was very kind and helpful!","date":"2021-07-19 16:41:00"}
{"review_id":"bo84t7BhmOnSoO-QapdjWQ","user_id":"VKZt7FYS087DWK4lCRjU4A","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I couldn't imagine what could actually be BEYOND bread.  I love-love-love bread, and I figured that there's nothing better.  Oh yes, there is!  First of all, the bread at Beyond Bread is beyond belief!  Delicious!  Like the Pretzel Loaf.  Wow!  And give me anything with green chilies in it.  They have such variety and every type of bread I've had there has registered as reluctant - yes, I was reluctant to eat the last bite!  (Ah, but there's always next time!)  Their sandwiches are my favorite - especially the one with Brie cheese, and  have them heat it so that the Brie melts.  Oh, yes - does life get much better than this?","date":"2017-08-03 04:30:17"}
{"review_id":"gcBdqBn4FNZyn0H879LtGA","user_id":"4jm0fxLhgLCw_bKC0WO9gQ","business_id":"WRSUURl5C9bQd-uoutOVVg","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"It's cool they collaborate with other breweries such as Dark Sky which is one of my fave breweries in Flagstaff. Cool outdoor space with cornhole. I didn't Grandpa's pajamas and the pepper (dark sky collaboration beer) were the two I enjoyed the most.","date":"2018-05-11 18:51:38"}
{"review_id":"5Z6RYNRuin4k0m8mwwrXgw","user_id":"TWtl1U4ZleVDt3XOEeMHyg","business_id":"OTVzS1GQo5Vqy6mP3I8rAA","stars":4.0,"useful":4,"funny":0,"cool":2,"text":"Great new location off of Maple Grove and Emerald. Stopped here for coffee and toast, one of my favorite breakfast combos. \nThe restaurant itself it very clean, welcoming spot. Friendly staff and counter service to order. Self serve drinks and coffee...Dawson Taylor! \nOpen for breakfast and lunch. A nice spot for a quick bite.","date":"2020-12-03 04:30:05"}
{"review_id":"yqclL-0up_wN0nSbCQKinA","user_id":"UUeC5sVtX0Ny-mML0bRn3w","business_id":"WRSUURl5C9bQd-uoutOVVg","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"This place is already solid, and my guess is that it's only going to get better. \n\nLove the pinup girls theme for the names of their beers (Ginger, Black Bettie, Bertha, Ruby...). Their logo is great and I dig the creativity. Speaking of, why not use the abandoned Fluffo Mattress factory and turn it into a brewery? \n\nThe entrance is in the back, through the beer garden. The front side of the building (on Main Street, a few blocks south of 5 Points) literally is the Fluffo Mattress factory, old signs and all. \n\nI love the beer garden - it's big, neatly landscaped, and feels like it's underground (you walk down a few flights of wooden stairs to get to the ground floor and the entrance to the tap room). \n\nSo far, my favorite brew is the Oatmeal Stout, but according to a friend who bartends there, they're planning on rolling out new beers fairly consistently. I still prefer Blackstone's beer overall, but there's lots of potential here. \n\nDo yourself a favor - order food. The \"specials\" menu rotates constantly, and everything I've tried has been great. The chef is ambitious, and the fare definitely rises above standard pub quality. I had a scallop special with braised turnip greens that knocked it out of the park. The charcuterie plate is delicious, as well. The food menu is limited, but it seems that their efforts here are focused very much on quality, not quantity. \n\nIf you're a Facebooker, they update their feed often with specials and daily food items.","date":"2012-11-29 22:55:45"}
{"review_id":"-Kimo8tJGVV_lXlRBtlRTw","user_id":"iv-7r9jL-S95MX5rKm6ZSw","business_id":"K47elujLPw0M369h-O_1hA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I ordered the Philly Cheesesteak minus the lettuce and tomato, with a side of fried green tomato. Staff is very friendly, place is clean and organized. They had my order ready in about 8 minutes with one or two ahead of me. That sandwich was absolutely wonderful as were the the tomato's! Highly reccomend. Hole in the wall gem.","date":"2021-07-01 12:05:05"}
{"review_id":"mt9J_Tqxc8-AGGGV7yRi-Q","user_id":"U0x_Oy_bZ9BlJMfAPhliAw","business_id":"QVmRgzIN3S2hvOja0HmM8Q","stars":1.0,"useful":1,"funny":1,"cool":0,"text":"This is the worst Chuck E cheese I have ever been to In My Life. The staff could  not  care less about their jobs there. When Chuck E Cheese came out on the hour to dance it was so obvious underneath the costume that they did not want to be there, I saw a child try to hug Chucky and Chucky pushed the kid away so it could not be hugged the child fell backwards onto the floor. The child could not have been older than four and started crying there were multiple employees around and no one offered to help the kid. \n\nI complained to the manager who came out and said \"yeah well the line of vision is very difficult inside the mask so when Chucky pushes the kids he cannot gauge how hard he is pushing them!!\" I then questioned why would Chucky even push a kid? And the manager Shrugged her shoulders.\n I was so surprised at how ghetto this place was as it is in a very nice area. \n\nThe woman at the prize booth was so annoyed with the children that took their time to pick their prizes. And children were running around unsupervised walking on the Skee-Ball tables and and hogging up the basketball games when they weren't playing them. Last time I will ever come here!","date":"2016-06-15 23:46:19"}
{"review_id":"sQcBlfzvU96G3yyV6WXKTg","user_id":"_z_MDfb3Z1Numo0Ugs2BeA","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Absolutely fantastic! You can tell that the host loves to make sure that his guests are happy and taken care of. And the food is everything! I'm still licking my fingers from the buttery garlic naan","date":"2019-07-27 20:42:56"}
{"review_id":"o5VBhxd1M2gw_rXtgeXSZw","user_id":"CAmBln6ogYRDby76A9r2IA","business_id":"WRSUURl5C9bQd-uoutOVVg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Fat Bottom Brewing is a great place to stop in and have a beer or snack. They have a rotating selection of craft brews, and a small menu of food to get. Didn't get any of the food, but all of the beer was good. Grab a flight and try them all before you choose, and you can grab cans of growlers to go. They do tours during the week that are worth checking out.","date":"2015-02-14 04:20:51"}
{"review_id":"BWere_svfb7HVXGPclZsWQ","user_id":"tqJxu8-N-PWiuZn30HTwng","business_id":"-Or44IdY51Ukd618kikmtA","stars":5.0,"useful":0,"funny":1,"cool":1,"text":"Just went here for the 1st time after hearing about it from my friends in the city.   Awesome donuts  (cookies and cream and stawberry) and coffee.  I tried the  cold brew.  Next time I'm in philly I need to try re chicken!  Please set up shop in KOP!! :)","date":"2017-10-05 15:23:29"}
{"review_id":"vZzS3Aburjp6_mIbgQxHdA","user_id":"HE1KIjrDxFwuZf_oDMNPIQ","business_id":"M5Nq0X3qbnafEVrTC5fvCw","stars":2.0,"useful":1,"funny":0,"cool":1,"text":"This review is for their minute clinic & not necessarily a representation of the store as a whole, but here we go...\n\nI woke up achey, fevery, & overall not well so made an appointment online. The earliest I could get was 2:15, so I booked the appointment online (convenient, right?!) I show up on time, & notice someone is already ahead of me. Turns out her appointment was for 1:30 & she had yet to be seen. That's annoying. So I ended up waiting for over an hour after my scheduled appointment time that I made sure to book beforehand. Not okay. Sitting in a CVS waiting room while sick is not what I would call ideal. \n\nOnce I was seen, the NP was nice enough, but not overly kind or caring. Got a flu test & had her check me out only to tell me that I just had a virus & that she wasn't even going to prescribe me anything. She recommended Tylenol... *sigh*","date":"2018-09-14 16:58:22"}
{"review_id":"PV0tN9qg5FElA9QlRYdjHA","user_id":"MnKIYqV9ohn7rnzl-I-rMA","business_id":"umq4JEgX4U6TIdMv-odD0Q","stars":3.0,"useful":1,"funny":0,"cool":0,"text":"Being Celiac in a town that fries water can be difficult. I went with a friend to this Willies that has 8 locations in the Quarter knowing that for me it would be nearly impossible to eat anything. I could eat the Jambalaya and to be fair, my friend did like the fried chicken. I thought the art  all over the walls and ceiling was really cool as long as you don't have a hangover. Not my kinda place due to my restrictions but the murals made it an interesting pit stop.","date":"2019-11-30 04:49:09"}
{"review_id":"8Ge9u2rxM2LEiMfizZ5cuA","user_id":"_gQWqkIPl5DyvgdmeG4e5w","business_id":"WRSUURl5C9bQd-uoutOVVg","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"I'm writing a very long over due review. Last April we had our wedding reception here. It was amazing! We could have not imagined anything better. They catered to our every need, even before we knew we needed it. The food was incredible. INCREDIBLE! The staff was very friendly. I wish I had another wedding just so I could have another party here!","date":"2014-05-16 06:06:52"}
{"review_id":"3s3BGO-r4177wNn07ZI6Pw","user_id":"m3o_za5PSmZdmkXm6MAnJg","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"I dream of this place. Being from Phoenix, I rarely make my way down to Tucson. BUT when I do, this place is on the top of my to-do list. The multigrain bread is so great, I often buy a loaf to bring back home with me. I wish they'd bring the franchise up to Phoenix!","date":"2009-10-27 20:34:11"}
{"review_id":"BYwqDG94BgInsIz4XbJZjA","user_id":"YAWDr98ReCzGfwAsaTKjEA","business_id":"gABEjWGwhojrub_tXqE2uw","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Love this place! So many types of delicious, HUGE quesadillas for a good price! The staff is very friendly and make you feel welcome.","date":"2014-02-21 17:31:47"}
{"review_id":"q6Hi1JMyhe8Z1CI6xRHhMg","user_id":"4475ayuejhQa5uuaPc1hIA","business_id":"Rx3JSrJyOyBseaJhYrVTSw","stars":1.0,"useful":13,"funny":3,"cool":0,"text":"WORST COMPANY EVER. It's a national chain with a Philly location. I chose them because they are cheaper than Safelite and they also come to your house. I was quoted $79. \n\nThey were scheduled to come to my house today at 3pm to fix a small chip in my windshield. At 3:20pm, I call the number just to make sure someone is on their way. They call the tech and say, yep he'll be here by 4pm, and that in the computer it says the appointment was scheduled for 3-4pm. Ok, misunderstanding, maybe, but I was told 3pm. I call again at 4:40pm and talk to Dawn, who calls the tech and says he's running late but he'll be there within the hour. Now I'm pissed because I was supposed to leave about that time. She offers for him to come first thing in the morning. I say no, I can't because I work, this is the only time that works for me which is why I scheduled it today. She says ok sorry he'll be there within the hour. So I'm waiting and waiting. At about 7:30 I've really had it and I call again and talk to Heather, who says that the last person I spoke with (Dawn or Violet) told the tech that I decided to do the appointment tomorrow morning instead. So he went home. Where the hell did she get that impression??? I had clearly said \"No, I can't do it tomorrow, I'll just wait around today.\" I hung up the phone in shock that these people could be so rude and incompetent. NEVER AGAIN.","date":"2012-11-06 00:52:36"}
{"review_id":"JvqIJ0gk9kfV86_cSCoZVg","user_id":"T6tRQYDAZTEWRKs5a2PDLg","business_id":"nRhBJZSwPEYVUEFQ_3gC6g","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Ernie at the front desk was so kind and pleasant that it gave a great first impression. Ernie also called to check up on us a couple days later with the same kind and pleasant manner. The nurses were also comforting to my daughter who was in tears from her pain. The physician assistant was also very kind and reassuring to me and my daughter. She quickly saw us and got us out. I  was blown away by how well we were treated. I highly recommend MedExpress.","date":"2019-01-02 13:32:46"}
{"review_id":"pcTJTSFZHib-bJnpO6U4Vw","user_id":"nn3hVNLbiG3iWHsUokujZw","business_id":"WRSUURl5C9bQd-uoutOVVg","stars":3.0,"useful":0,"funny":0,"cool":0,"text":"I have been to Fat Bottom twice now and had their beers on a few other occasions. The ambiance is nice, and the limited menu offers some items that stand up nicely to the beers.  For a new brewery I think they are finding their way nicely. The Rhonda and Black Betty are two of my favorites. Last night I had a flight with a Blue Burger and then picked a pint of Rhonda. The burger was very juicy, just the right amount of tang from the blue cheese, but perhaps heavy handed with the mustard.  I am a girl who loves her mustard but that made the burger pretty messy to eat.   There was a side of potato wedges which were cooked well but completely unseasoned. This wouldn't have been an issue if there were s&p on the table.  To be fair, I still ate them all. Two friends ordered the charcuterie board. It had a very generous display, including some blood sausage which was only appreciated by the more adventurous diners, but enjoyed by those. My only other comment is the seating. The tables are beautiful, as are the benches. The benches however are REALLY heavy and only seat two comfortably. If one is sitting already you have to completely stand up to move the seat and get the second person in. The gorgeous benches look like they were an investment so I don't see that changing but its just my observation. If they decide to unload them I would happily take one. The courtyard looks great so I can't wait for DST and warm weather to get out there and enjoy it!  All in all I think this is a great spot and love seeing development on this end of Gallatin Road.","date":"2013-03-02 14:40:46"}
{"review_id":"5IMvTn3CE1MOegn4XSgd2Q","user_id":"wCTjDczgVB0169pcHVrtgQ","business_id":"Gay6ZhRBF8SNF5YudevDoQ","stars":5.0,"useful":1,"funny":0,"cool":2,"text":"There's just no way that I can stand idly by and not do my part to bring up the rating average for Brown Betty's. \n\nI've tried many a cupcakery, and BB is one of my favorites. It differentiates itself from other places by using a moist, thick pound cake -that's not too sweet!- as the cake base.\n\nIf you need some convincing, try a sample. Particularly at this original BB boutique, the largest of the three locations, there are always heaps of cake samples set out on large platters. \n\nThey aren't messing around with the frostings here either. Whether based in buttercream or cream cheese, the frosting is always wonderfully dense and flavorful. \n\nI know that red velvet (named \"Jean's Road Trip\") is their best seller, but I rather prefer the almond (\"Alice's Two Step,\" almond flavor in the cake as well as the slivers of almond on top of chocolate frostiing) and the pineapple (I think it's called \"Aunt Eva Says\"-- pineapple puree in the cake and a candied pineapple on top of the cream cheese-based frosting). Yums. \n\nMy only caution: don't bother with the cookies. They're mediocre at best, and not worth your time. Better to focus on getting around to trying as many BB cupcake flavors as possible.","date":"2010-11-06 05:21:41"}
{"review_id":"w8w1RnB3xWRXHk5uEeLnQw","user_id":"UuhMGm3uPWe7ilqFmc4f7w","business_id":"OWL2B9wYz7w9DnD2JiLJ4Q","stars":1.0,"useful":3,"funny":0,"cool":0,"text":"If you want a pathetic incompetent hospital then this is the place for you. I went there in October and gave them my insurance information and tried to pay my co pay they said they'll mail a bill. I have sent the payment 3 times and they still call once weekly. My fiancee went there and when she came home her arm had a 3 inch bruise because the incompetent nurse kept stabbing her with the IV multiple times, she couldn't locate the vein even though you can clearly see the vein. Stay away from this poor excuse of a Hospital.","date":"2018-02-16 14:23:23"}
{"review_id":"1JGWYItaIO-NtOGt001J4w","user_id":"ZoNfQYo2AY9KVZ6ytCBkVw","business_id":"sTfVZ9xo36tU8R5DnaCGkg","stars":4.0,"useful":1,"funny":0,"cool":0,"text":"Finally! Authentic tacos some place other than Taco Bus. I discovered this place on Yelp and decided to give it a try. The tacos were made fresh to order and man, were they tasty. If you don't like spicy, ask for mild because they do have a little kick to them. The carnitas and lengua (beef tongue) were my favorite fillings for the tacos. I was hesitant to try beef tongue but it was so flavorful and delicious. Taste even better than chicken!\n\nThey also have a grocery store that sells cheap snacks and drinks. Support your local businesses and check this place out, you won't be disappointed.","date":"2014-11-17 21:46:44"}
{"review_id":"WA36XZn68J4IsNR8GcrtrA","user_id":"9-EzrXCHpG4AJFzdMzHatg","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Not just for sandwiches. Go for the DESSERTS!  While I do love the sandwiches here, particularly Bart's Bag, I have to say that I think they have some great desserts. Picked up the eclair and Key Lime Tart tonight. Don't think the whipped cream on top really did much for me, but overall thought both were pretty good.  If you like fruit tarts then you should try theirs. It's FANTASTIC!","date":"2014-03-01 04:00:08"}
{"review_id":"LRpi7q6Es79XYi0mwbrPkg","user_id":"hTzC6eXiVq63T0SaVE5Now","business_id":"Gay6ZhRBF8SNF5YudevDoQ","stars":5.0,"useful":3,"funny":0,"cool":2,"text":"I am not a sweets fan at all, but when I stumbled upon this place and had the red velvet cupcake, I admit to defeat.  It was the right texture, moisture, and sweetness.  I haven't had the other flavors, but from the decorations and the quality of the presentation...I'd have to give it 5 stars.  I live in New York, where Magnolia is over rated and over hyped by Sex And The City.  Some may dispute that Crumbs is better than Magnolia, but in my opinion - Brown Betty tops them all!  I hope more people discover this hidden treasure in Northern Liberties because it's definitely worth the trip!","date":"2008-09-04 03:08:21"}
{"review_id":"pGo3MPbbUH9CAm_OTIcehQ","user_id":"9XDFZlGs4-QwQx44YODnWQ","business_id":"8OPE0UaZHf7vdYkgbIj8vg","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"I don't even know where to start.  \nMy friends and I were headed to the Linkin Park concert and decided to pop in on th way to Deer Creek(yes Deer Creek). \n\nThe waitress started off with I am so excited I don't have to work tonight...well it was obvious she wasn't working much anyway.  There were a few people in the place.  But not overly busy. They only had one waitress working the inside and outside.  She took our drink orders and brought them back and never came back, left us with our menus for like 25 minutes.   We ordered.  This is an english pub and grill. Nothing english about the food.   The food for basic pub grub took about 35 minutes to come out.  ONe person in our party ordered a pizza and it came out as a sandwich. The waitress apologized but never offered to fix it. I ordered a sandwich and a cup of soup that was half way full. I'm not sure if someone got hungry on the way to my table or what.   THe food was ok.  Nothing over the top and exciting.  THe waitress gave us an empty bottle of ketchup. She was never around and when I went to the bar...the bartender gave me a bottle of ketchup that was about 1\/4 of the way full.   It was like a national ketchup shortage was going on and rations were low.    My friends straw had a gnat on it.....just this place is not impressive.\n\n\nThe service was awful, the food was mediocre.  Not in a hurry to go back. Unless they get a shipment of ketchup.  Sorry your tip was only $5 bucks on our bill...but you could have done better.\n\nWe developed the saying...What Would Gordon Ramsey do?  while in here....and the vote was he'd piss on the table and say it was crap.   For shame for shame what do you expect for a chain I guess......","date":"2012-08-26 18:08:11"}
{"review_id":"Mfss88nOCGdyHkZZCfXNBw","user_id":"w09ZGP9pIZJxNfofwLfarg","business_id":"-Or44IdY51Ukd618kikmtA","stars":2.0,"useful":2,"funny":0,"cool":0,"text":"Honestly, I don't understand all the hype about this place. We went there around 2pm, so there wasn't that much variety of donuts, which I understand. We got one of each kind of donut that was left(4 donuts), and out of all of them, only one was good(ish). The donuts are soft on the inside like mushy cake, not like how most donuts taste like. The fried chicken was nothing special, either. We got the honey soy glazed, buttermilk ranch, and z'atar flavors, and while the chicken on the inside was quite tender, and the outside was crunchy, the flavoring was just off and fake-tasting. Someone in our group even said that Popeyes chicken tastes better. My expectations for this place were pretty high, considering all of the good reviews, and this place did not at all meet my expectations.","date":"2014-08-01 19:35:30"}
{"review_id":"95ptx7ghJ8dXBeleWuyCmw","user_id":"wDoW3-K2P7DfQUP7nq5tfw","business_id":"0yELPu1_7T-V3InzfEPS7g","stars":4.0,"useful":0,"funny":0,"cool":0,"text":"Well if you ask me I would be the first to admit all of the following are true about Tio's..yes it's in a run down strip center that probably had it's hey day in the first few years of The Carter Administration...yes it's located next to a business I did not realize still existed(a Laundromat)..yes to quote a Springsteen Lyric \"it's in a part of town when you hit a red light you don't stop\" and yes I took no photos of Tio's because some of the cats that were in there are the types that probably get pretty nervous about having their pictures taken by strangers and would have no clue what the hell I was talking about if I tried to explain I was taking pictures for Yelp...having said all that if you are looking for the most authentic Mexican Food and Tacos in North Pinellas this is definitely the place....it's dingy and unappealing inside with only about 6 or 7 Tables so do like most and just order your food to go...we drive 30 minutes each way just to get bulk orders of their tortillas(which many do) when we are making a Spanish Feast at the House...have no clue what they do to make them so good, but you can watch The Madre making each Tortilla from scratch when you walk in the door and they are some of the best I have ever had..a good piece of advice is to have a working knowledge of Spanish or Spanglish when you walk in the door, because no one here really speaks or cares to speak English and the Menu on the wall is in a strange Spanish\/English Hybrid...last time I was there some old Snowbird Couple was trying to make an order while wanting certain items taken out without realizing The Madre and The Hija had no idea what they were saying..they just stood there with that quizzical grin people have when they have no clue what you are saying...I wanted to yell at the old couple \"you do realize you could be telling these two people you are aliens from Mars and they would have the same looks on their face right?\"...finally I deduced they wanted \"no onions\" on their food so I told The Madre \"no cebolla\" and she got a big smile on her face and yelled back to the kitchen...my good deed was rewarded when I ordered my veinte tortillas because when I got back to the house I noticed they had given me cinco extra!!..nice...amazingly the one time they know English quite well is when it comes time to pay..they damn sure know how many dollars and cents you owe them..and speaking of dollars and cents you better bring them because this joint is cash only...I definitely recommend Tio's as a great North Pinellas Taco\/Enchilada Joint...just get your food to go in the daylight hours and to quote another Springsteen Lyric you wont have to be \"born to run\"","date":"2014-03-28 03:24:11"}
{"review_id":"nkWm8brZ4XcglxIpfIS93A","user_id":"KOAiivAy6lk8O-_zwdh6yQ","business_id":"B_ULY8xaOEx4PZxauoSmow","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"Went here after reading some good reviews. Obviously, they were old reviews. Dining area was dirty, unsanitary conditions especially during the Covid Pandemic. They made our food incorrectly even though it was correct on the order receipt. Rice in the Burrito was extremely soggy and tasteless. Salsa bar was boring and unappealing. I would have had better food at Taco Bell. Sorry. I give this place a huge thumbs down.","date":"2020-07-22 05:20:10"}
{"review_id":"Um27i3P5bTegsH3vUp9myA","user_id":"sFOz5wV1HeSAIyt6leoOfw","business_id":"B_ULY8xaOEx4PZxauoSmow","stars":4.0,"useful":1,"funny":1,"cool":1,"text":"Stopped in for a quick burrito recently\n\nThe good\nThe authentic California Burrito is a substantial portion. If you like a burrito with distinct flavors and not a ton of beans, this is for you. \n\nCondiments taste freshly made and have distinct flavors and heat profiles. Options run from 'white girl hot', to 'clear your sinuses' and they all had good flavor.\n\nThe value\nIt was just before the lunch rush and it was clearly popular with the local contractors, as almost everyone had a company truck parked outside and teams of guys in bright shirts filled the tables. I knew when I walked in, it would be a good value.\n\nThe meh.\nThe wait time. Took quite a while to get a burrito made, even though there wasn't a line at the counter when I walked in.\n\nThe bad - nothing.\n\nI'll be back for sure.","date":"2021-12-07 15:25:00"}
{"review_id":"0rrvMNlMr1iNi2Ts-rTCww","user_id":"cfV08DdaisqoC1r-AxMvDw","business_id":"7TkgWz7fLbMBjkS_RTTOIg","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Always a great experience. I've had Botox, fillers and facials and am always very happy with the results. Nurse Jenny never tries to persuade you to do more than necessary and focuses on getting you the results you want.","date":"2021-08-06 14:26:07"}
{"review_id":"Oxz1bAaV7qcyZmjXbsP-kA","user_id":"O1s61C2FeWgMCqnJ6Ol_SQ","business_id":"mHzTDjMxRPiWtuzEn3xOpg","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Small pizza shop but definitely the best pizza in the area. Always friendly staff and great service. Stop on in and grab a slice or order an entire pie. They got you covered.","date":"2020-05-18 01:13:42"}
{"review_id":"_Fil3pLg4Ak1QS-Zx-_Mqw","user_id":"2ChRcoH3f7fshsddAhXNsw","business_id":"ki0qSHmHNgUjKPRzYDTPow","stars":2.0,"useful":2,"funny":0,"cool":1,"text":"Not sure yet about the food but the wait sucks. Standing here wit at least 10 open tables. The hostess claims they are \"reserved\" but I think that's an excuse. It's Father's Day so I anticipate a bit of a wait but seriously at least 10 open tables is just poor planning. Try calling for a reservation to see if it's true.\n\nUpdate in the food. Finally got seated after waiting longer than necessary with at least 10 open tables. I believe the problem was a lack of servers - very poor planning. Our server was very nice however the food was cold. I don't blame her as it seems that she was running back and forth to compensate for lack of staff. The place has some potential but if they cannot manage the place properly then it's not worth going back.","date":"2016-06-19 14:33:31"}
{"review_id":"Y9Iniz2MVuYMxCV2aF3bWg","user_id":"Qy6S-AYesilxTX49xa6Fuw","business_id":"WRSUURl5C9bQd-uoutOVVg","stars":1.0,"useful":1,"funny":0,"cool":0,"text":"The most rude female behind the bar....a wedding party and she wants everyone to quiet dw....she is such a jewel!!! Krista is a bitch!!!","date":"2018-07-07 04:02:00"}
{"review_id":"HxhAZ4JMFxoQCCbz9ZXnkg","user_id":"fx7ozfY5AwQZWyU-Bbq-RQ","business_id":"Cfl4gpf9oneiuZUExMtA4w","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Every time I order from here I am so pleased with it. I used to live in India and got my partner into eating the food. This place not only gives me nostalgia but the food is phenomenal. So happy I've found this spot. We definitely order from here at least once a week. Tikka Paneer is our fave","date":"2020-05-11 01:05:42"}
{"review_id":"9B0Q2gxWqhJy5VIbdOWMeA","user_id":"vzPTjVZG0-5MO7jGGeNwTw","business_id":"9tWLiz52KN-S7CFZvBhslA","stars":2.0,"useful":4,"funny":6,"cool":1,"text":"If you're on a budget, they have free bread, just be sure to grab it while it's crowded.  Deserts are awful.  Coffee is awful, bread is hard, low quality.\n\nThe food is average but dumb yuppies think this is the best place since Wall Street.\n\nEmployees are yapping, stuffing their mouths or ignoring you while there's a line.  \n\nTables are left unclean.   Employees are mostly acne faced un-hygenic teens (ie: cheap labor) who seemed to be picking their noses, drinking sodas, touching their hair, genital area, etc while I waited.\n\nProbably less aggravation & cheaper to make it yourself, if you dumb yuppies can figure it out.  I don't know what the catch is at Beyond Bread.  It's Beyond me.","date":"2008-10-17 04:04:39"}
{"review_id":"1ttAQuEkWNCKdJbh3Tl_JA","user_id":"9_MjcE9N_okTAqAG8Va2Zg","business_id":"-Or44IdY51Ukd618kikmtA","stars":5.0,"useful":1,"funny":0,"cool":0,"text":"Some of the best donuts I have ever had. My job order them for the office one time and I have been hooked. I decided to try two donuts and they were worth it. The location is low key and parking is great.","date":"2019-07-02 04:04:22"}
{"review_id":"XmJp0zL_ebDzZrjU8OuNyA","user_id":"KhloggVS0Daa7q14tq6GDA","business_id":"-Or44IdY51Ukd618kikmtA","stars":4.0,"useful":1,"funny":1,"cool":1,"text":"Get the hot and fresh donuts! They won't disappoint, slightly warm and made fresh. These were more cake based and yummy. Coffee was eh, I got the draft latte and it had a ton of foam and by the time it settled the cup was only half full. The staff was super friendly and understood and topped it off when I brought it up. This location has limited seating outdoors, no indoor seating. Expect a 5 min wait for the hot and fresh donuts. I would definitely recommend you stop in and get a donut!","date":"2021-10-02 20:00:38"}
{"review_id":"0hPEZbeeiQqUIade5lerkw","user_id":"fkXNcNnEF72Dy-_2GTOSoA","business_id":"nRhBJZSwPEYVUEFQ_3gC6g","stars":1.0,"useful":0,"funny":0,"cool":0,"text":"Very bad just bad. Had to wait for too long for a small test. Unfriendly, unorganized, and very not nice. I would never go there anymore. Bad bad","date":"2015-12-01 18:38:27"}
{"review_id":"rqspbn_LC2-j3nlYWuj03g","user_id":"6-JIEbGcRCBnQR4UBda8jg","business_id":"-Or44IdY51Ukd618kikmtA","stars":5.0,"useful":0,"funny":0,"cool":0,"text":"Just moved from Brooklyn and Dough Donuts. I  really liked the Donuts made fresh and oil free and a sane size.  Calling all cars ala jack Webb to come and get your coffee and Donuts right here!","date":"2014-08-09 01:34:14"}